greet = "Привет, {name}, я бот, генрирующий Sankey-диаграммы по вашим выпискам из банков ☺️"
main_menu = "📍 Главное меню"

gen_text = "📝 Отправьте текст запроса к нейросети для генерации текста"
bank_menu = "Выберите из списка банк, выписку которого вы хотите загрузить"
load_vtb = "Отправьте сообщение с прекрепленным файлом выписки банка ВТБ"
load_sber = "Отправьте сообщение с прекрепленным файлом выписки банка Сбер"
load_y = "Отправьте сообщение с прекрепленным файлом выписки банка Яндекс"
load_t = "Отправьте сообщение с прекрепленным файлом выписки банка Т-банк"


gen_image = "🖼 Отправьте текст запроса к нейросети для генерации изображения"
gen_exit = "Чтобы выйти из диалога с нейросетью нажмите на кнопку ниже"
gen_error = f'🚫 Ошибка генерации. Возможные причины:\n1. Перегружены сервера OpenAI\n2. Ваш запрос нарушил правила OpenAI\n3. Ошибка в работе бота\nЕсли вы считаете, что проблема вызвана неисправностью бота, сообщите админу'
text_watermark = '\n_______________________________________\nСоздано при помощи @dalle_chatgpt_bot'
img_watermark = "Создано при помощи @dalle_chatgpt_bot"
gen_wait = "⏳Пожалуйста, подождите немного, пока нейросеть обрабатывает ваш запрос..."

err = "🚫 К сожалению произошла ошибка, попробуйте позже"